"use client";

import { useEffect } from "react";
import ButtonSubmit from "./button-submit";
import { motion } from "framer-motion";

import "@/assets/css/termsModal.css";

interface TermsModalProps {
  onAccept: () => void;
  onDecline: () => void;
}

export default function TermsModal({ onAccept, onDecline }: TermsModalProps) {
  
  useEffect(() => {
    document.documentElement.style.overflow = "hidden";
    document.body.style.overflow = "hidden";
    return () => {
      document.documentElement.removeAttribute("style");
      document.body.removeAttribute("style");
    }
  }, []);

  return (
    <div className="pdpa-modal fixed top-0 left-0 flex-center w-full h-100dvh">
      <motion.div 
        initial={{ opacity: 0, y: 20 }}
        whileInView={{ opacity: 1, y: 0 }}
        viewport={{ once: true }}
        transition={{ 
          duration: 0.9,
          ease: [0.17, 0.55, 0.55, 1],
        }}
        className="pdpa-content relative w-725 mb-w-725 rounded-49 pt-45 pl-40 pr-40 mb-rounded-49 mb-pt-45 mb-pl-40 mb-pr-40">
        <p className="headText-pdpa inline font-size-29 mb-font-size-29 font-normal">ข้อกำหนดและเงื่อนไข สำหรับระบบสมาชิก V Serenade บริษัท วี เอ็กคลูซีฟ กรุ๊ป จำกัด</p>
        <div className="box-text-pdpa pt-32 mb-pt-32">
          <div className="custom-scrollbar color-midnight-black h-full font-light overflow-y-auto font-size-23 mb-font-size-23 pr-25 mb-pr-25 pb-30 mb-pb-30">
            <p className="text-indent mb-20 mb-mb-20">
            บริษัท วี เอ็กคลูซีฟ กรุ๊ป จำกัด (ต่อไปนี้เรียกว่า “บริษัท”) ขอแจ้งให้ทราบถึงข้อกำหนดและเงื่อนไขในการเข้าร่วมโปรแกรมสมาชิก V Serenade ซึ่งเป็นส่วนหนึ่งของโปรแกรมการตลาดของบริษัท โดยมีวัตถุประสงค์เพื่อมอบสิทธิประโยชน์ให้กับลูกค้าที่ใช้บริการของบริษัท
            </p>
            <p className="mb-20 mb-mb-20"><strong>การสมัครสมาชิก</strong></p>
            <p className="text-indent">ลูกค้าของ วี สแควร์ คลินิก สามารถลงทะเบียนเพื่อเป็นสมาชิกผ่านแอปพลิเคชัน Line “V Square Clinic” ในขั้นตอนการลงทะเบียน สมาชิกต้องกรอกข้อมูลส่วนบุคคล ได้แก่ ชื่อ-นามสกุล อีเมล (ถ้ามี) และเบอร์โทรศัพท์</p>
            <p className="text-indent mb-20 mb-mb-20">ท่านสามารถอ่านรายละเอียดเพิ่มเติมเกี่ยวกับข้อกำหนดและเงื่อนไขการเก็บรวบรวม การใช้ และการเปิดเผยข้อมูลส่วนบุคคลได้ที่ <strong>“นโยบายในการคุ้มครองข้อมูลส่วนบุคคล (Data Protection Policy) และนโยบายคุกกี้ (Cookie Policy)”</strong> เพื่อทำความเข้าใจอย่างละเอียดถึงวิธีการที่เราเก็บรวบรวมข้อมูล การใช้ข้อมูล การเปิดเผยข้อมูล และวิธีการแก้ไขหรือเปลี่ยนแปลงข้อมูลส่วนบุคคลของท่าน</p>
            <p className="mb-20 mb-mb-20"><strong>บัญชีสมาชิก</strong></p>
            <p className="text-indent">สงวนสิทธิ์ 1 บัญชี ต่อ 1 ท่านเท่านั้น ไม่สามารถจำหน่าย โอน หรือใช้ร่วมกับบุคคลอื่นได้ หากฝ่าฝืน บริษัทจะพิจารณาให้มีผลเป็นโมฆะทั้งหมด</p>
            <p className="text-indent mb-20 mb-mb-20">ผู้ใช้งานจะต้องกดขอรับและยืนยันรหัสผ่านแบบใช้ครั้งเดียว (OTP) เพื่อยืนยันการสมัครสมาชิก</p>
            <p className="mb-20 mb-mb-20"><strong>การสะสมยอดเพื่อรับสิทธิพิเศษ</strong></p>
            <p className="text-indent mb-20 mb-mb-20">เมื่อเข้ารับบริการที่สาขาของวี สแควร์ คลินิก ยอดใช้จ่ายที่นำมาคิดเป็นยอดสะสมคือยอดสุทธิหลังหักส่วนลด โดยยอดสะสมจะถูกบันทึกเข้าบัญชีของสมาชิกภายใน 24 ชั่วโมงหลังการใช้จ่าย</p>
            <p className="mb-20 mb-mb-20"><strong>ระดับสมาชิก</strong></p>
            <p className="text-indent mb-20 mb-mb-20">ระดับสมาชิกจะแบ่งออกเป็น 3 ระดับ โดยพิจารณาจากยอดใช้จ่ายสะสมภายในระยะเวลา 1 ปี หรือยอดใช้จ่ายสูงสุดในแต่ละใบเสร็จ ดังนี้:</p>
            <ol className="mb-20 mb-mb-20">
              <li><strong>V Member:</strong>
                <ul>
                  <li>ยอดใช้จ่ายสะสม 0 - 299,999 บาท</li>
                </ul>
              </li>
              <li><strong>V Gold:</strong>
                <ul>
                  <li>ยอดใช้จ่ายสะสม 300,000 บาท ภายในระยะเวลา 1 ปี หรือ</li>
                  <li>มียอดใช้จ่ายตั้งแต่ 150,000 บาทขึ้นไปต่อใบเสร็จ</li>
                </ul>
              </li>
              <li><strong>V Platinum:</strong> ยอดใช้จ่ายสะสม 500,000 บาท ภายในระยะเวลา 1 ปี หรือยอดใช้จ่าย 250,000 บาทต่อใบเสร็จ
                <ul>
                  <li>ยอดใช้จ่ายสะสม 500,000 บาท ภายในระยะเวลา 1 ปี หรือ</li>
                  <li>มียอดใช้จ่ายตั้งแต่ 250,000 บาทขึ้นไปต่อใบเสร็จ</li>
                </ul>
              </li>
            </ol>
            <p className="text-indent mb-20 mb-mb-20">ในกรณีที่ท่านสะสมยอดใช้จ่ายครบตามเกณฑ์ที่กำหนดก่อนสิ้นสุดระยะเวลา 1 ปี ท่านจะได้รับการปรับระดับสมาชิกขึ้นทันที และสามารถเริ่มใช้สิทธิประโยชน์ของระดับใหม่ได้ตั้งแต่วันถัดไป โดยระยะเวลาการเป็นสมาชิกในระดับ V Platinum หรือ V Gold จะมีผลบังคับใช้ในปีปฏิทินที่ท่านได้รับการปรับระดับ และจะขยายระยะเวลาต่อเนื่องไปจนถึงสิ้นปีปฏิทินถัดไป</p>
            <p className="mb-20 mb-mb-20">ตัวอย่าง:</p>
            <p className="text-indent mb-20 mb-mb-20">หากท่านมียอดใช้จ่ายตั้งแต่ 150,000 บาทต่อใบเสร็จ ในวันที่ 1 ตุลาคม พ.ศ. 2568 ระบบจะปรับระดับสมาชิกของท่านเป็น V Gold โดยอัตโนมัติ และท่านจะสามารถเริ่มใช้สิทธิประโยชน์ของระดับ V Gold ได้ตั้งแต่วันที่ 2 ตุลาคม พ.ศ. 2568 เป็นต้นไป ซึ่งสิทธิ์ดังกล่าวจะมีผลถึงวันที่ 31 ธันวาคม พ.ศ. 2569 เป็นต้น</p>
            <hr className="mb-20 mb-mb-20"></hr>
            <p className="mb-20 mb-mb-20"><strong>สิทธิประโยชน์ สำหรับสมาชิก V Gold / V Platinum</strong></p>
            <p className="text-indent mb-20 mb-mb-20">สำหรับสมาชิก V Gold / V Platinum สามารถใช้สิทธิประโยชน์ได้ที่ วี สแควร์ คลินิก ทุกสาขา ดังนี้</p>
            <ul className="mb-20 mb-mb-20">
              <li><strong>ระดับ V Gold:</strong> สามารถเลือกรับ <strong>วิตามินผิวแบบฉีดเข้าเส้นเลือด</strong> มูลค่า 2,500 บาท หรือ <strong>เลเซอร์ขน</strong> มูลค่า 2,500 บาท อย่างใดอย่างหนึ่งทุกเดือน หรือเลือกรับ <strong>Ultraformer III</strong> (ทำหัตถการโดยนักกายภาพบำบัด) จำนวน 200 line ทุก 3 เดือน</li>
              <li><strong>ระดับ V Platinum:</strong> สามารถเลือกรับ <strong>วิตามินผิวแบบฉีดเข้าเส้นเลือด</strong> มูลค่า 4,500 บาท หรือ <strong>เลเซอร์ขน</strong> มูลค่า 5,000 บาท อย่างใดอย่างหนึ่งทุกเดือน หรือเลือกรับ <strong>Ultraformer III</strong> (ทำหัตถการโดยนักกายภาพบำบัด) จำนวน 400 line ทุก 3 เดือน</li>
            </ul>
            <p className="text-indent mb-20 mb-mb-20">ทั้งนี้ ต้องใช้สิทธิ์ของแต่ละเดือนภายในเดือนนั้น ๆ ไม่สามารถใช้สิทธิ์ล่วงหน้าหรือย้อนหลังได้ สิทธิ์จะหมดอายุทุกเดือน</p>
            <p className="text-indent mb-20 mb-mb-20">ในกรณีที่มีค่าใช้จ่ายส่วนเกินจากสิทธิ์ที่ได้รับ ท่านจะต้องเป็นผู้รับผิดชอบค่าใช้จ่ายส่วนต่างเพิ่มเติม</p>
            <p className="mb-20 mb-mb-20"><strong>การสะสมยอดเพื่อรักษาสถานะสมาชิก</strong></p>
            <ul className="mb-20 mb-mb-20">
              <li>สมาชิกสามารถสะสมยอดใช้บริการได้ตั้งแต่วันที่ <strong>1 มกราคม - 31 ธันวาคม</strong> ของทุกปี</li>
              <li>ในวันที่ 31 ธันวาคม เวลา 23:59 น. ระบบจะคำนวณยอดสะสมเพื่อกำหนดระดับสมาชิกที่ท่านจะได้รับสิทธิใน <strong>ปีถัดไป</strong> และสามารถใช้สิทธิของระดับนั้นได้ตลอด 1 ปี (ตั้งแต่วันที่ 1 มกราคม - 31 ธันวาคม)</li>
              <li>ยอดสะสมจะถูกตัดเป็น 0 บาท ในวันที่ 31 ธันวาคม เวลา 23:59 น. และเริ่มนับยอดสะสมใหม่ตั้งแต่วันที่ 1 มกราคม ของทุกปี</li>
              <li>หากท่านต้องการรักษาหรือเพิ่มระดับสมาชิก สามารถทำได้โดยการสะสมยอดใช้บริการตลอดทั้งปี หรือยอดใช้บริการต่อครั้งตามเงื่อนไขที่กำหนด</li>
            </ul>
            <p className="mb-20 mb-mb-20"><strong>ข้อจำกัด</strong></p>
            <ul className="mb-20 mb-mb-20">
              <li>สิทธิพิเศษนี้ <strong>ไม่สามารถแลกหรือทอนเป็นเงินสดได้</strong></li>
              <li>สิทธิพิเศษนี้ <strong>ไม่สามารถโอนหรือให้สิทธิแก่สมาชิกอื่นหรือบุคคลอื่นได้</strong></li>
              <li>เมื่อใช้สิทธิพิเศษแล้ว <strong>ไม่สามารถยกเลิกหรือเปลี่ยนแปลงได้ทุกกรณี</strong></li>
            </ul>
            <p className="mb-20 mb-mb-20"><strong>การเปลี่ยนแปลงข้อกำหนดและเงื่อนไข</strong></p>
            <p className="text-indent mb-20 mb-mb-20">บริษัทสงวนสิทธิ์ในการเปลี่ยนแปลง ปรับปรุง แก้ไข หรือเพิ่มเติมข้อกำหนดและเงื่อนไขของระบบนี้ทั้งหมดหรือบางส่วนได้ตลอดเวลาและเป็นครั้งคราว โดยจะเผยแพร่ฉบับแก้ไขหรือปรับปรุงบนเว็บไซต์ของบริษัท หรือผ่านช่องทางอื่นที่บริษัทเห็นสมควร การเปลี่ยนแปลงจะมีผลบังคับใช้ ณ วันที่มีการเผยแพร่</p>
            <p className="text-indent mb-20 mb-mb-20">ทั้งนี้ บริษัทจะแจ้งให้ท่านทราบถึงรายการเปลี่ยนแปลงที่สำคัญ แต่ท่านยังมีหน้าที่ในการตรวจสอบข้อกำหนดและเงื่อนไขของโปรแกรมเป็นประจำเพื่อให้มั่นใจว่าท่านได้รับทราบข้อกำหนดและเงื่อนไขล่าสุดที่ผูกพันท่าน การที่ท่านเข้าร่วมระบบสมาชิกอย่างต่อเนื่องจะถือว่าท่านได้ตกลงและยอมรับการเปลี่ยนแปลงดังกล่าว ในกรณีที่ท่านไม่เห็นด้วยกับการเปลี่ยนแปลง ท่านจะต้องระงับการเข้าร่วมระบบสมาชิกโดยทันที</p>
            <p className="mb-20 mb-mb-20"><strong>ข้อปฏิเสธความรับผิด</strong></p>
            <p className="text-indent mb-20 mb-mb-20">บริษัทขอปฏิเสธความรับผิดใด ๆ ที่เกิดขึ้นหรือเกี่ยวข้องกับการใช้งานระบบสมาชิกตามขอบเขตสูงสุดที่กฎหมายกำหนดให้สามารถทำได้ ไม่ว่าความรับผิดดังกล่าวจะเกิดขึ้นจากกรณีใดก็ตาม ซึ่งรวมถึงแต่ไม่จำกัดเพียง ความเสียหายหรือความผิดพลาดด้านการใช้งานของระบบคอมพิวเตอร์หรืออุปกรณ์ใด ๆ การสูญเสียรายได้ กำไร หรือความเสียหายใด ๆ ทั้งทางตรงและทางอ้อม ความเสียหายข้างเคียง หรือความเสียหายสืบเนื่อง รวมถึงบุคคลที่สาม</p>
            <p className="text-indent mb-20 mb-mb-20">บริษัทจะไม่รับผิดต่อข้อเรียกร้อง ความสูญเสีย ความเสียหาย หรือค่าใช้จ่ายใด ๆ ที่เกิดขึ้นกับสมาชิก อันเนื่องมาจากหรือเกี่ยวข้องกับเหตุต่อไปนี้:</p>
            <ul className="mb-20 mb-mb-20">
              <li>ความสูญหายของข้อมูลหรือรายการบันทึกเกี่ยวกับบัญชีสมาชิก</li>
              <li>ความผิดพลาดหรือเหตุที่ไม่สามารถเข้าใช้งานแอปพลิเคชันหรือบัญชีสมาชิก</li>
            </ul>
            <p className="text-indent mb-20 mb-mb-20">เพื่อความชัดเจน การยกเลิกหรือระงับระบบสะสมยอดโดยบริษัทไม่ก่อให้เกิดสิทธิ์ใด ๆ แก่สมาชิกในการเรียกร้องหรือได้รับค่าสินไหมทดแทนใด ๆ จากบริษัทสำหรับความสูญเสียหรือความเสียหายที่เกิดขึ้นไม่ว่าทางตรงหรือทางอ้อมจากการยกเลิกหรือระงับดังกล่าว</p>
            <p className="text-indent mb-20 mb-mb-20">ในกรณีที่มีข้อพิพาทใด ๆ เกี่ยวกับระบบนี้ การตัดสินของบริษัทถือเป็นที่ยุติและสิ้นสุด</p>
          </div>
        </div>
        <div className="flex-center-start gap-40 mb-gap-40 pt-29 mb-pt-29">
          <motion.button 
            initial={{ opacity: 0, y: 10 }}
            whileInView={{ opacity: 1, y: 0 }}
            viewport={{ once: true }}
            transition={{ 
              duration: 0.9,
              ease: [0.17, 0.55, 0.55, 1],
              delay: 0.2,
            }}
            onClick={() => { onDecline(); }} 
            className="flex-center font-light font-kanit font-size-30 mb-font-size-30 rounded-17 mb-rounded-17 text-color-white-light bg-color-gray-soft w-283 h-81 mb-w-283 mb-h-81">
            ไม่ยอมรับ
          </motion.button>
          <motion.button
            initial={{ opacity: 0, y: 10 }}
            whileInView={{ opacity: 1, y: 0 }}
            viewport={{ once: true }}
            transition={{ 
              duration: 0.9,
              ease: [0.17, 0.55, 0.55, 1],
              delay: 0.4,
            }} 
            onClick={() => { onAccept(); }} 
            className="flex-center font-light font-kanit font-size-30 mb-font-size-30 rounded-17 mb-rounded-17 text-color-white-light bg-color-blue w-283 h-81 mb-w-283 mb-h-81">
            ยอมรับ
          </motion.button>
          {/* <ButtonSubmit 
            variant="gray_bg"
            className="w-283 h-81 mb-w-283 mb-h-81"
            onClick={() => {
              onDecline();
            }}
          >
            ไม่ยอมรับ
          </ButtonSubmit>
          <ButtonSubmit 
            variant="blue_bg"
            className="w-283 h-81 mb-w-283 mb-h-81"
            onClick={() => {
              onAccept();
            }}
          >
            ยอมรับ
          </ButtonSubmit> */}
        </div>
      </motion.div>
    </div>
  )
}
